docs/examples/rfxcel_number_request.xml

<soapenv:Envelope
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:ns="http://xmlns.rfxcel.com/traceability/serializationService/3"
xmlns:ns1="http://xmlns.rfxcel.com/traceability/3"
xmlns:xm="http://www.w3.org/2004/11/xmlmime">
	<soapenv:Header>
		<wsa:Action xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">http://wsop.rfxcel.com/messaging/2/getMessages</wsa:Action>
		<wsa:ReplyTo xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">
			<wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address>
		</wsa:ReplyTo>
		<wsa:To xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">https://rfxcel.net/services/IrfxMessagingSoapHttpPort</wsa:To>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
           <!--optional
			<wsu:Timestamp wsu:Id="TS-2">
				<wsu:Created>2016-02-12T16:27:08Z</wsu:Created>
				<wsu:Expires>2016-02-12T16:27:08Z</wsu:Expires>
			</wsu:Timestamp>-->
			<wsse:UsernameToken wsu:Id="UsernameToken-1">
				<wsse:Username>{{authentication_info.username}}</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{{authentication_info.password}}</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>

	</soapenv:Header>
	<soapenv:Body>
		<ns:syncAllocateTraceIds contentStructVer="3.1.3" createDateTime="2016-11-08T18:56:34.112Z" requestId="Allocate-032-6">
		       <!-- Corporate ID -->
			<ns:orgId qlfr="ORG_DEF">{{ org_sgln }}</ns:orgId>
			<ns:eventId>{{ allocate.random_event_id}}</ns:eventId>
			<!--Product Code is GTIN-->
			<ns:itemId qlfr="{{ item_id_type }}">{{ item_value }}</ns:itemId>
			<ns:siteHierId qlfr="ORG_DEF">{{ site_hier_id}}</ns:siteHierId>
			<!-- Facility ID -->
			<ns:siteId qlfr="SGLN" type="LOCATION">{{ site_gln}}</ns:siteId>
			<ns:idTextFormat>PURE_ID_URI</ns:idTextFormat>
			<ns:separatePrefixSuffix>{{separate_prefix_suffix}}</ns:separatePrefixSuffix>
			<ns:returnDataStruct>LIST</ns:returnDataStruct>
			<ns:idCount>{{ allocate.size }}</ns:idCount>
		</ns:syncAllocateTraceIds>
	</soapenv:Body>
</soapenv:Envelope>
